/*REXX*/
/*DROP designa el valor de una variable*/

VAR1='ABCD'
SAY 'VAR1 ANTES DE DROP:' VAR1
DROP VAR1
SAY 'VAR1 DESPUES DE DROP:' VAR1
VAR1=''
SAY 'VAR1 DESPUES CON VALOR NULO:' VAR1
PAUSE
