/*REXX*/
/*XRANGE(inicio,final)*/
/*Devuelve una cadena con todos los caracteres comprendidos entre "inicio" y "final".*/


SAY XRANGE("A","Z")    /*"ABCDEFG...UVWXYZ" */
SAY XRANGE("a","z")    /*"abcdefg...uvwxyz" */
SAY XRANGE(0,9)        /* "0123456789" */


PAUSE
